// Напишите программу, которая принимает на вход два  числа и выдаёт какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2; b = 10 -> max = 10
//a = -9 b = -3 -> max = -3

// start

// int a = 5, b = 12;
// int max = 0;
// if (a > b)
// {
 //   max = a;
// }
// else 
// {
   //  max = b;
// }

// Console.WriteLine(max);

int a = -9;
int b = 79
;
int max = a; 

if(b>max)
{
    max = b;
}
System.Console.WriteLine(max);

// end